In [1]:
# -----------------------------------------------------
# 결측치 처리
# -----------------------------------------------------

In [2]:
import pandas as pd
import numpy as np

In [15]:
# DF 생성 ---------------------------------------------
data=[[10,13,np.nan,7],[2,np.nan,np.nan,1],[21,31,np.nan,51],[21,31,np.nan,51]]

dataDF=pd.DataFrame(data)
dataDF

    0     1   2   3
0  10  13.0 NaN   7
1   2   NaN NaN   1
2  21  31.0 NaN  51
3  21  31.0 NaN  51

In [16]:
# nan 한개라도 있으면 삭제, 행방향
dataDF.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [17]:
# nan 한개라도 있으면 삭제, 열방향
dataDF.dropna(axis=1)

    0   3
0  10   7
1   2   1
2  21  51
3  21  51

In [18]:
# 모든값이 nan이면 삭제, 행방향 
dataDF.dropna(how='all')

    0     1   2   3
0  10  13.0 NaN   7
1   2   NaN NaN   1
2  21  31.0 NaN  51
3  21  31.0 NaN  51

In [19]:
# [기본값 변경]모든값이 nan이면 삭제, 열방향 
dataDF.dropna(how='all',axis=1)

    0     1   3
0  10  13.0   7
1   2   NaN   1
2  21  31.0  51
3  21  31.0  51

In [24]:
# [기본값 변경] 컬럼 또는 행 데이터의 정상데이터의 갯수를 기준으로 그 이하인 경우 삭제
dataDF.dropna(thresh=3)

    0     1   2   3
0  10  13.0 NaN   7
2  21  31.0 NaN  51
3  21  31.0 NaN  51

In [25]:
dataDF.dropna(thresh=1,axis=1)

    0     1   3
0  10  13.0   7
1   2   NaN   1
2  21  31.0  51
3  21  31.0  51

In [26]:
# [기본값 변경] 특정 컬럼 지정해서 그 컬럼만 nan 확인
dataDF.dropna(subset=[1])

    0     1   2   3
0  10  13.0 NaN   7
2  21  31.0 NaN  51
3  21  31.0 NaN  51

In [27]:
dataDF.dropna(subset=[1],axis=1)

    0   3
0  10   7
1   2   1
2  21  51
3  21  51